In [2]:
import pandas as pd
df = pd.read_excel("data.xlsx")

    Cartoon Name  Starting Year     Channel Name  Age
0  Tom and Jerry           1940  Cartoon Network   23
1       Doraemon           1979   Disney Channel   54
2         Ben 10           2005  Cartoon Network   34
3       Shinchan           1992       Hungama TV   75
4        Pokémon           1997  Cartoon Network   86
5   Chhota Bheem           2008          Pogo TV   89
6     Scooby-Doo           1969  Cartoon Network   43
7     Motu Patlu           2012      Nickelodeon   32

In [14]:
import pandas as pd
df = pd.read_excel("data.xlsx")
print(df['Age'])  
df['Cartoon Name']

0    23
1    54
2    34
3    75
4    86
5    89
6    43
7    32
Name: Age, dtype: int64

0    Tom and Jerry
1         Doraemon
2           Ben 10
3         Shinchan
4          Pokémon
5     Chhota Bheem
6       Scooby-Doo
7       Motu Patlu
Name: Cartoon Name, dtype: object

In [17]:
df.at[3, "Age"]   # Fast label-based access

np.int64(75)

In [21]:
df[df['Age']>60]

   Cartoon Name  Starting Year     Channel Name  Age
3      Shinchan           1992       Hungama TV   75
4       Pokémon           1997  Cartoon Network   86
5  Chhota Bheem           2008          Pogo TV   89

######

In [29]:
df[(df['Starting Year']>1992) & (df['Age']>45)]

   Cartoon Name  Starting Year     Channel Name  Age
4       Pokémon           1997  Cartoon Network   86
5  Chhota Bheem           2008          Pogo TV   89

In [30]:
df.query("`Cartoon Name`== 'Pokémon'")

  Cartoon Name  Starting Year     Channel Name  Age
4      Pokémon           1997  Cartoon Network   86